In [12]:
import pandas as pd
import numpy as np

raw_data = {'first_name': ['Jason', np.nan, 'Tina', 'Jake', 'Amy'],
            'last_name': ['Miller', np.nan, 'Ali', 'Milner', 'Cooze'],
            'age': [42, np.nan, 36, 24, 73],
            'sex': ['m', np.nan, 'f', 'm', 'f'],
            'preTestScore': [4, np.nan, np.nan, 2, 3],
            'postTestScore': [25, np.nan, np.nan, 62, 70]}

df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'sex', 'preTestScore', 'postTestScore'])
df

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Tina       Ali  36.0    f           NaN            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [13]:
df_dropped = df.dropna(thresh=2) #4개 이상의 non-Na 값이 있는 행만 남김
print(df_dropped)

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
2       Tina       Ali  36.0   f           NaN            NaN
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [14]:
df_dropped = df.dropna(thresh=4) # 4개 이상의 non-Na 값이 있는 행만 남김
print(df_dropped)

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
2       Tina       Ali  36.0   f           NaN            NaN
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [30]:
import pandas as pd
import numpy as np

raw_data = {'first_name': ['Jason', np.nan, 'Tina', 'Jake', 'Amy', 'Yeonghyun', 'nana', 'gildong'],
            'last_name': ['Miller', np.nan, 'Ali', 'Milner', 'Cooze', 'Kim', 'Ann', 'hong' ],
            'age': [42, np.nan, 36, 24, 73, 24, 22, 90],
            'sex': ['m', np.nan, 'f', 'm', 'f', 'm', 'f', 'm'],
            'preTestScore': [4, np.nan, np.nan, 2, 3, 5, 8, 9],
            'postTestScore': [25, np.nan, np.nan, 62, 70, 90, 50, 55]}

df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'sex', 'preTestScore', 'postTestScore'])
df

print(df.fillna(0))

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
1          0         0   0.0   0           0.0            0.0
2       Tina       Ali  36.0   f           0.0            0.0
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0
5  Yeonghyun       Kim  24.0   m           5.0           90.0
6       nana       Ann  22.0   f           8.0           50.0
7    gildong      hong  90.0   m           9.0           55.0

In [31]:
#기말고사에 나올 확률 높음.
df["preTestScore"] = df["preTestScore"].fillna(df["preTestScore"].mean())
df

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m      4.000000           25.0
1        NaN       NaN   NaN  NaN      5.166667            NaN
2       Tina       Ali  36.0    f      5.166667            NaN
3       Jake    Milner  24.0    m      2.000000           62.0
4        Amy     Cooze  73.0    f      3.000000           70.0
5  Yeonghyun       Kim  24.0    m      5.000000           90.0
6       nana       Ann  22.0    f      8.000000           50.0
7    gildong      hong  90.0    m      9.000000           55.0

In [32]:
group_df = df.groupby('sex')["postTestScore"].transform("mean")
print(group_df)

0    58.0
1     NaN
2    60.0
3    58.0
4    60.0
5    58.0
6    60.0
7    58.0
Name: postTestScore, dtype: float64

In [33]:
df.loc[2, 'postTestScore'] = group_df[2]
print(df)

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m      4.000000           25.0
1        NaN       NaN   NaN  NaN      5.166667            NaN
2       Tina       Ali  36.0    f      5.166667           60.0
3       Jake    Milner  24.0    m      2.000000           62.0
4        Amy     Cooze  73.0    f      3.000000           70.0
5  Yeonghyun       Kim  24.0    m      5.000000           90.0
6       nana       Ann  22.0    f      8.000000           50.0
7    gildong      hong  90.0    m      9.000000           55.0

In [35]:
#실전에서 많이 사용하는 방법
for i in df.index:
    if pd.isnull(df.loc[i, 'postTestScore']):
        df.loc[i, 'postTestScore'] = group_df[i]
print(df)

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m      4.000000           25.0
1        NaN       NaN   NaN  NaN      5.166667            NaN
2       Tina       Ali  36.0    f      5.166667           60.0
3       Jake    Milner  24.0    m      2.000000           62.0
4        Amy     Cooze  73.0    f      3.000000           70.0
5  Yeonghyun       Kim  24.0    m      5.000000           90.0
6       nana       Ann  22.0    f      8.000000           50.0
7    gildong      hong  90.0    m      9.000000           55.0

In [37]:
df['postTestScore'] = df['postTestScore'].fillna(df.groupby('sex')['postTestScore'].transform('mean'))
print(df)

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m      4.000000           25.0
1        NaN       NaN   NaN  NaN      5.166667            NaN
2       Tina       Ali  36.0    f      5.166667           60.0
3       Jake    Milner  24.0    m      2.000000           62.0
4        Amy     Cooze  73.0    f      3.000000           70.0
5  Yeonghyun       Kim  24.0    m      5.000000           90.0
6       nana       Ann  22.0    f      8.000000           50.0
7    gildong      hong  90.0    m      9.000000           55.0

In [43]:
edges = pd.DataFrame({
    'color': ['red', 'blue', 'green', 'red', 'hello', 'kim'],
    'value': [1, 2, 3, 4, 5, 9]
})
print(edges)

   color  value
0    red      1
1   blue      2
2  green      3
3    red      4
4  hello      5
5    kim      9

In [44]:
dummy_edges = pd.get_dummies(edges,columns=['color'])
print(dummy_edges)

   value  color_blue  color_green  color_hello  color_kim  color_red
0      1       False        False        False      False       True
1      2        True        False        False      False      False
2      3       False         True        False      False      False
3      4       False        False        False      False       True
4      5       False        False         True      False      False
5      9       False        False        False       True      False